Version2/TestTool/TestTool.Setup/Requests/MediaConf/SetAudioEncoderConfiguration/SetAudioEncoderConfiguration (2).xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trt:SetAudioEncoderConfiguration>
      <trt:Configuration token="encoder1">
        <tt:Name>TestName1</tt:Name>
        <tt:UseCount>1</tt:UseCount>
        <tt:Encoding>G726</tt:Encoding>
        <tt:Bitrate>96</tt:Bitrate>
        <tt:SimpleRate>22</tt:SimpleRate>
        <tt:Multicast>
          <tt:Address>
            <tt:Type>IPv4</tt:Type>
            <tt:IPv4Address>255.255.255.255</tt:IPv4Address>
          </tt:Address>
          <tt:Port>1234</tt:Port>
          <tt:TTL>1</tt:TTL>
          <tt:AutoStart>true</tt:AutoStart>
        </tt:Multicast>
        <tt:SessionTimeout>PT1H1M1S</tt:SessionTimeout>
      </trt:Configuration>
      <trt:ForcePersistence>true</trt:ForcePersistence>
    </trt:SetAudioEncoderConfiguration>
  </soap:Body>
</soap:Envelope>